Repository: witnet/my-wit-wallet
Catalog: lib/l10n/app_*.arb
Languages: es

# walletSecurity02
source: A wallet is an app that keeps your credentials safe and lets you interface with the Witnet blockchain. It allows you to easily transfer and receive Wit.
es: Una cartera es una aplicación que mantiene seguras tus credenciales y te permite interactuar con la cadena de bloques de Witnet. Te permite transferir y recibir Wit de manera sencilla.

# walletSecurity03
source: You should never share your seed phrase with anyone. We at Witnet do not store your seed phrase and will never ask you to share it with us. If you lose your seed phrase, you will permanently lose access to your wallet and your funds.
es: Nunca debes compartir tu frase de recuperación con nadie. Nosotros en Witnet no almacenamos tu frase de recuperación y nunca te pediremos que la compartas con nosotros. Si pierdes tu frase de recuperación, perderás permanentemente el acceso a tu cartera y a tus fondos.

# walletSecurity04
source: If someone finds or sees your seed phrase, they will have access to your wallet and all of your funds.
es: Si alguien encuentra o ve tu frase de recuperación, tendrá acceso a tu cartera y a todos tus fondos.

# walletSecurity05
source: We recommend storing your seed phrase on paper somewhere safe. Do not store it in a file on your computer or anywhere electronically.
es: Recomendamos almacenar tu frase de recuperación en papel en un lugar seguro. No la almacenes en un archivo en tu computadora ni en ningún lugar electrónico.

# walletSecurity06
source: By accepting these disclaimers, you commit to comply with the explained restrictions and digitally sign your conformance using your Witnet wallet.
es: Al aceptar estos avisos, te comprometes a cumplir con las restricciones explicadas y a firmar digitalmente tu conformidad utilizando tu cartera de Witnet.

# walletSecurityConfirmLabel
source: I will be careful, I promise!
es: ¡Seré cuidadoso, lo prometo!

# walletSecurityHeader
source: Wallet security
es: Seguridad de la cartera

# walletTypeHDLabel
source: HD Wallet
es: HD Cartera

# walletTypeNodeLabel
source: Node
es: Nodo

source: Welcome
es: Bienvenido

source: What to do?
es: ¿Qué hacer?

# xprvInputHint
source: Your Xprv key (starts with xprv...)
es: Tu clave Xprv (comienza con xprv...)

source: Xprv Origin
es: Origen de Xprv

source: Your message...
es: Tu mensaje...

# addressBalanceDescription
source: Received payments totalling
es: Recibió pagos por un total de

source: Loading
es: Cargando

# sendValueTransferTransaction
source: Value Transfer Transaction
es: Transacción de Transferencia de Valor

# sendStakeTransaction
source: Stake Transaction
es: Transacción de Stake

# sendUnstakeTransaction
source: Unstake Transaction
es: Transacción de Unstake

source: Network contribution
es: Contribución a la red

source: Fees and rewards
es: Tasas y Recompensas

# totalDataSynced
source: Scan summary
es: Datos syncronizados

source: Welcome back
es: Bienvenido de nuevo
