Repository: witnet/my-wit-wallet
Catalog: lib/l10n/app_*.arb
Languages: es

# addTimelockLabel
source: Add Timelock (Optional)
es: Añadir Timelock (Opcional)

source: Address
es: Dirección

source: Address list
es: Lista de direcciones

source: Address copied!
es: ¡Dirección copiada!

source: Advanced Settings
es: Configuración avanzada

source: Amount
es: Cantidad

source: Authenticate with biometrics
es: Autenticación biométrica

# authorization
source: Node authorization
es: Autorización del nodo

# authorizationInputHint
source: Node authorization...
es: Autorización del nodo...

# autorizationTooltip
source: Node authorization to stake
es: Autorización del nodo para realizar staking

source: Available
es: Disponible

# backLabel
source: Back
es: Volver

source: balance
es: saldo

source: Balance details
es: Saldo en detalle

# biometricsLabel
source: Biometrics
es: Biométricas

source: Blocks mined
es: Bloques extraídos

# buildWallet01
source: The different addresses in your wallet are being scanned for existing transactions and balance. This will normally take less than 1 minute.
es: Se están escaneando las diferentes direcciones de tu cartera en busca de transacciones y saldo existentes. Esto normalmente tomará menos de 1 minuto.

# buildWalletBalance
source: Balance
es: Saldo

# buildWalletHeader
source: Address discovery
es: Descubrimiento de direcciones

source: Cancel
es: Cancelar

source: Cancel authentication
es: Cancelar autentificación

# carouselMsg01
source: myWitWallet allows you to send and receive Wit immediately. Bye bye synchronization!
es: myWitWallet te permite enviar y recibir Wit al instante. ¡Adiós a la sincronización!

# carouselMsg02
source: myWitWallet uses state-of-the-art cryptography to store your Wit coins securely.
es: myWitWallet utiliza la criptografía de última generación para almacenar tus monedas Wit de manera segura.

# carouselMsg03
source: myWitWallet is completely non-custodial. Your keys will never leave your device.
es: myWitWallet es completamente no custodial. Tus claves nunca saldrán de tu dispositivo.

# chooseMinerFee
source: Choose you desired miner fee
es: Elija la tasa minera que desee

# clearTimelockLabel
source: Clear Timelock
es: Borrar Timelock

source: Click to install
es: Haz clic para instalar.

source: Close
es: cerrar

source: Confirm
es: Confirmar

# confirmMnemonic01
source: Type in your secret recovery phrase below exactly as shown before. This will ensure that you have written down your secret recovery phrase correctly.
es: Escribe tu frase de recuperación secreta a continuación exactamente como se muestra. Esto asegurará que hayas escrito tu frase de recuperación secreta correctamente.

# confirmMnemonicHeader
source: Secret Recovery Phrase Confirmation
es: Confirmación de la frase de recuperación secreta

source: Confirm Password
es: Confirmar contraseña

source: Confirmed
es: Confirmada

# connectionIssue
source: myWitWallet is experiencing connection problems
es: myWitWallet está experimentando problemas de conexión

source: Connection reestablished!
es: ¡Conexión restablecida!

# continueLabel
source: Continue
es: Continuar

# copyAddressConfirmed
source: Address copied!
es: ¡Dirección copiada!

# copyAddressLabel
source: Copy selected address
es: Copiar dirección seleccionada

source: Copy address to clipboard
es: Copiar dirección en el portapapeles

source: Copy JSON
es: Copiar JSON

# copyXprvConfirmed
source: Xprv copied!
es: ¡Xprv copiado!

# copyXprvLabel
source: Copy Xprv
es: Copiar Xprv

# createImportWallet01
source: When you created your wallet, you probably wrote down the secret security phrase on a piece of paper. It looks like a list of 12 apparently random words.
es: Cuando creaste tu cartera, probablemente escribiste la frase de seguridad secreta en un papel. Parece una lista de 12 palabras aparentemente aleatorias.

# createImportWallet02
source: If you did not keep the secret security phrase, you can still export a password-protected Xprv key from the settings of your existing wallet.
es: Si no conservaste la frase de seguridad secreta, aún puedes exportar una clave Xprv protegida con contraseña desde la configuración de tu cartera existente.

# createImportWalletHeader
source: Create or import your wallet
es: Crear o importar tu cartera

# createNewWalletLabel
source: Create new wallet
es: Crear nueva cartera

# createOrImportLabel
source: Create or import
es: Crear o importar

# createWalletLabel
source: Create wallet
es: Crear cartera

# cryptoException
source: Error building the wallet
es: Error creando el wallet

source: Current address
es: dirección actual

source: Dark Mode
es: Modo oscuro

# dashboardViewSteps
source: {selectedIndex, select, transactions{Transactions} stats{Stats} other{unused}}
es: {selectedIndex, select, transactions{Transacciones} stats{Estadísticas} other{unused}}

# datePickerFormatError
source: Invalid date format
es: Formato de fecha no válido

# datePickerHintText
source: Select date
es: Seleccionar fecha

# datePickerInvalid
source: Invalid date
es: Fecha no válida

source: Delete
es: Eliminar

# deleteStorageWarning
source: Your storage is about to be permanently deleted!
es: Tu almacenamiento está a punto de ser eliminado permanentemente.

source: Delete wallet
es: Eliminar wallet

# deleteWallet01
source: Clicking "Delete" will result in the permanent deletion of your current wallet data. If you proceed, you'll need to import the wallet again to access your funds.
es: Hacer clic en "Eliminar" resultará en la eliminación permanente de los datos de tu wallet actual. Si procedes, deberás importar la wallet nuevamente para acceder a tus fondos.

# deleteWalletSuccess
source: Your wallet data has been successfully deleted!
es: ¡Los datos de tu wallet han sido eliminados exitosamente!

# deleteWalletWarning
source: Your wallet is about to be permanently deleted!
es: ¡Tu wallet está a punto de ser eliminada permanentemente!

source: Downloading...
es: Descargando...

# drSolved
source: Data requests solved
es: Solicitudes de datos resueltas

# emptyStakeMessage
source: Stake some $WIT! Secure the network, earn rewards, and be part of a censorship-resistant oracle.
es: ¡Haz stake de algunos $WIT! Asegura la red, gana recompensas y forma parte de un oráculo resistente a la censura.

# emptyStakeTitle
source: You donÂ´t have balance to unstake
es: No tienes saldo para retirar stake

source: Enable login with biometrics
es: Inicio de sesión con datos biométricos

# encryptWallet01
source: This password encrypts your Witnet wallet only on this computer.
es: Esta contraseña encripta tu cartera Witnet solo en esta computadora.

# encryptWallet02
source: This is not your backup and you cannot restore your wallet with this password.
es: Esta no es tu copia de seguridad y no puedes restaurar tu cartera con esta contraseña.

# encryptWallet03
source: Your {mnemonicLength} word seed phrase is still your ultimate recovery method.
es: Tu frase de recuperación de {mnemonicLength} palabras sigue siendo tu método de recuperación definitivo.

# encryptWalletHeader
source: Encrypt your wallet
es: Encripta tu cartera

source: Enter your Password
es: Escriba su contraseña

source: Epoch
es: Época

# errorDeletingWallet
source: There was an error deleting the wallet, please try again!
es: ¡Hubo un error al eliminar la wallet, por favor inténtalo de nuevo!

# errorReestablish
source: There was an error re-establishing myWitWallet, please try again!
es: Se ha producido un error al restablecer myWitWallet, inténtalo de nuevo.

# errorSigning
source: Error signing message
es: Mensaje de error al firmar

# errorTransaction
source: Error sending the transaction, try again!
es: Error al enviar la transacción, ¡inténtelo de nuevo!

source: Error. Try Again.
es: Error. Inténtalo de nuevo.

# estimatedFeeOptions
source: {feeOption, select, stinky{Stinky} low{Low} medium{Medium} high{High} opulent{Opulent} custom{Custom} other{}}
es: {feeOption, select, stinky{Apestoso} low{Bajo} medium{Medio} high{High} opulent{Alta} custom{A medida} other{}}

source: Explored addresses
es: Direcciones exploradas

source: Exploring address:
es: Explorando dirección:

source: Export JSON
es: Exportar JSON

source: Export Xprv
es: Exportar Xprv

source: Fee
es: Tasa

# feeTypeOptions
source: {feeType, select, absolute{Absolute} weighted{Weighted} other{}}
es: {feeType, select, absolute{Absoluto} weighted{Ponderado} other{}}

source: Fees collected
es: Comisiones cobradas

source: Fees payed
es: Comisiones pagadas

# forgetPassword
source: Did you forget your password?, You can delete your wallet and configure a new one!
es: ¿Has olvidado tu contraseña?, ¡Puedes borrar tu monedero y configurar uno nuevo!

source: From
es: de

# generateAddressWarning
source: You are about to generate a new address
es: Estás a punto de generar una nueva dirección

# generateAddressWarningMessage
source: A new address will be generated and ready to be used. The main address displayed in the navigation will be updated to the new one.
es: Una nueva dirección estará disponible para su uso. La dirección mostrada en la barra de navegación se actualizará a la nueva dirección generada.

# genNewAddressLabel
source: Generate new Address
es: Generar nueva dirección

# generateMnemonic01
source: These {mnemonicLength} apparently random words are your secret recovery phrase. They will allow you to recover your Wit coins if you uninstall this app or forget your wallet lock password.
es: Estas {mnemonicLength} palabras aparentemente aleatorias son tu frase de recuperación secreta. Te permitirán recuperar tus monedas Wit si desinstalas esta aplicación o olvidas la contraseña de bloqueo de tu cartera.

# generateMnemonic02
source: You must write down your secret recovery phrase on a piece of paper and store it somewhere safe. Do not store it in a file in your device or anywhere else electronically. If you lose your secret recovery phrase, you may permanently lose access to your wallet and your Wit coins.
es: Debes escribir tu frase de recuperación secreta en un papel y almacenarla en un lugar seguro. No la almacenes en un archivo en tu dispositivo ni en ningún otro lugar electrónico. Si pierdes tu frase de recuperación secreta, podrías perder permanentemente el acceso a tu cartera y tus monedas Wit.

# generateMnemonic03
source: You should never share your secret recovery phrase with anyone. If someone finds or sees your secret recovery phrase, they will have full access to your wallet and your Wit coins.
es: Nunca debes compartir tu frase de recuperación secreta con nadie. Si alguien encuentra o ve tu frase de recuperación secreta, tendrá acceso completo a tu cartera y tus monedas Wit.

# generateMnemonicHeader
source: Write down your secret recovery phrase
es: Escribe tu frase de recuperación secreta

source: Generate Xprv
es: Generar Xprv

source: Generated address
es: Dirección generada

source: Generated addresses
es: Direcciones generadas

source: History
es: Historia

# home
source: Transactions list
es: Lista de transacciones

source: Hour
es: Hora

# importMnemonic01
source: Type your secret recovery phrase below. It looks like a list of 12 apparently random words.
es: Escribe tu frase de recuperación secreta a continuación. Parece una lista de 12 palabras aparentemente aleatorias.

# importMnemonicHeader
source: Import wallet from secret recovery phrase
es: Importar cartera desde la frase de recuperación secreta

# importMnemonicLabel
source: Import wallet from secret recovery phrase
es: Importar cartera desde la frase de recuperación secreta

# importWalletLabel
source: Import wallet
es: Importar cartera

# importXprv01
source: Xprv is a key exchange format that encodes and protects your wallet with a password. Xprv keys look like a long sequence of apparently random letters and numbers, preceded by "xprv".
es: Xprv es un formato de intercambio de claves que codifica y protege tu cartera con una contraseña. Las claves Xprv se ven como una larga secuencia de letras y números aparentemente aleatorios, precedidos por "xprv".

# importXprv02
source: To import your wallet from an Xprv key encrypted with a password, you need to type the key itself and its password below:
es: Para importar tu cartera desde una clave Xprv encriptada con una contraseña, debes escribir la clave misma y su contraseña a continuación:

# importXprvHeader
source: Import wallet from an Xprv key
es: Importar cartera desde una clave Xprv

# importXprvLabel
source: Import from Xprv key
es: Importar desde la clave Xprv

source: Initializing Wallet.
es: Inicializando cartera.

# inputAmountHint
source: Input an amount
es: Ingresar un monto

# inputPasswordPrompt
source: Please, input your wallet's password.
es: Por favor, ingresa la contraseña de tu cartera.

source: Input your password
es: Ingresa tu contraseña

source: Inputs
es: Insumos

source: Insufficient funds
es: Fondos insuficientes

# insufficientUtxosAvailable
source: Wait untill the pending transactions are confirmed or try creating a transaction with a smaller amount.
es: Espera a la confirmación de las transacciones pendientes o crea una transacción con una cantidad más pequeña.

source: Internal balance
es: Saldo interno

# internalBalanceHint
source: The internal balance corresponds to the sum of all the change accounts available balance
es: El saldo interno corresponde a la suma del saldo disponible en todas las cuentas de cambio

source: Invalid Password
es: Contraseña inválida

source: Invalid Xprv:
es: Xprv inválido:

# invalidXprvBlank
source: Field is blank
es: El campo está en blanco

# invalidXprvStart
source: needs to start with "xprv1"
es: debe comenzar con "xprv1"

source: JSON copied!
es: JSON copiado!

source: Later
es: Más tarde

# launchUrlError
source: Could not launch {error}
es: No se pudo abrir {error}

source: Light Mode
es: Modo claro

# lockWalletLabel
source: Lock wallet
es: Bloquear cartera

source: Lock your wallet
es: Bloquea tu cartera

source: Locked
es: Bloqueado

source: Message Signing
es: Firma de mensajes

# messageSigning01
source: Prove the ownership of your address by adding your signature to a message.
es: Demuestre la propiedad de su dirección añadiendo su firma a un mensaje.

source: Message to be signed
es: Mensaje a firmar

source: Mined
es: Minada

# minerFeeHint
source: By default, 'Absolute fee' is selected. To set a custom weighted fee, you need to select 'Weighted'. The Weighted fee is automatically calculated by the wallet considering the network congestion and transaction weight multiplied by the value selected as custom.
es: Por defecto, la tarifa Absoluta está seleccionada. La comisión ponderada la calcula automáticamente el monedero teniendo en cuenta la congestión de la red y el peso de la transacción multiplicado por el valor seleccionado como personalizado.

# minerFeeInputHint
source: Input the miner fee
es: Introduzca la tasa minera

source: Minutes
es: Minutos

# nameLabel
source: Name
es: Nombre

# newVersion
source: New Version: {versionNumber}
es: Nueva versión: {versionNumber}

# newVersionAvailable
source: A new version of the app is available.
es: Nueva versión disponible.

# noTransactions
source: You don't have transactions yet!
es: ¡Aún no tienes transacciones!

# okLabel
source: Ok
es: Aceptar

source: Outputs
es: Salidas

# passwordDescription
source: This password encrypts your xprv file. You will be asked to type this password if you want to import this xprv as a backup.
es: Esta contraseña encripta tu archivo xprv. Se te pedirá que ingreses esta contraseña si deseas importar este xprv como copia de seguridad.

# passwordLabel
source: Password
es: Contraseña

source: Pending
es: Pendiente

source: Please wait...
es: Por favor, espera...

# preferenceTabs
source: {selectedTab, select, general{General} wallet{Wallet} other{unused}}
es: {selectedTab, select, general{General} wallet{Cartera} other{unused}}

# readCarefully
source: Please, read carefully before continuing. Your attention is crucial!
es: Por favor, lea atentamente antes de continuar. Su atención es crucial.

source: Ready to install
es: Listo para instalar.

source: Receive
es: Recibir

source: Recipient address
es: Dirección del receptor

source: Re-establish
es: Restablecer

# reestablishInstructions
source: Clicking "Continue" will result in the permanent deletion of your current wallet data. If you proceed, you'll need to import an existing wallet to access your funds or create a new one.
es: Al hacer clic en "Continuar" se eliminarán permanentemente los datos de su monedero actual. Si continúa, tendrá que importar un monedero existente o crear uno nuevo para acceder a sus fondos.

# reestablishSteps01
source: Make sure you have stored your recovery seed phrase or Xprv.
es: Asegúrese de que ha almacenado su frase semilla de recuperación o Xprv.

# reestablishSteps02
source: Click "Continue" to delete your storage and import your wallet again.
es: Haga clic en "Continuar" para borrar su almacenamiento e importar su monedero de nuevo.

# reestablishSucess
source: myWitWallet has been successfully re-established!
es: ¡myWitWallet se ha restablecido con éxito!

source: Re-establish wallet
es: Restablecer cartera

source: Re-establish your wallet
es: Restablezca su cartera

source: Reverted
es: Revertida

source: Scan a QR code
es: Escanear un código QR

# scanQrCodeLabel
source: Scan QR code
es: Escanear código QR

# selectImportOptionHeader
source: Import your wallet
es: Importar tu cartera

source: Send
es: Enviar

# sendReceiveTx
source: Send or receive WIT
es: Enviar o recibir WIT

source: Set Timelock
es: fijar bloqueo horario

source: Settings
es: Ajustes

source: Show balance details
es: Mostrar detalles del balace

source: Show password
es: Mostrar contraseña

source: Show wallet list
es: Mostrar lista de carteras

source: Sign and Send
es: Firmar y enviar

source: Sign Message
es: Signo Mensaje

# signMessageError
source: Error signing message
es: Error firmando el mensaje

source: Speed up
es: Acelerar

# speedUpTxTitle
source: Speed up transaction
es: Acelerar transacción

# stakeTxnSuccess
source: Stake transaction succesfully sent!
es: ¡Transacción de stake enviada con éxito!

# stakeUnstake
source: Stake or unstake WIT
es: Stake o unstake WIT

source: Status
es: Estado

source: Theme
es: Tema

# timePickerHintText
source: Set Time
es: Hora fijada

# timePickerInvalid
source: Invalid time
es: tiempo inválido

source: Timelock
es: bloqueo temporizado

# timelockTooltip
source: The recipient will not be able to spend the coins before this date and time.
es: El beneficiario no podrá gastar las monedas antes de esa fecha y hora.

source: Timestamp
es: Marca de tiempo

source: To
es: a

source: Total fees paid
es: Total de tasas pagadas

source: Total mining rewards
es: Recompensas mineras totales

source: Transaction
es: Transacción

source: Transaction details
es: Detalles de la transacción

source: Transaction ID
es: ID de la transacción

source: Transactions found
es: Transacciones encontradas

source: Try again!
es: ¡Inténtalo de nuevo!

# txEmptyState
source: You don't have transactions yet!
es: ¡Todavía no tienes transacciones!

# txnCheckStatus
source: Check the transaction status in the Witnet Block Explorer:
es: Compruebe el estado de la transacción en el Explorador de bloques de Witnet:

# txnDetails
source: Transaction details
es: Detalles de la transacción

# txnSending
source: Sending transaction
es: Transacción de envío

# txnSending01
source: The transaction is being sent
es: La transacción se está enviando

# txnSigning
source: Singing transaction
es: Transacción de canto

# txnSigning01
source: The transaction is being signed
es: Se está firmando la transacción

# txnStatus
source: {feeType, select, pending{pending} mined{mined} confirmed{confirmed} other{}}
es: {feeType, select, pending{pendiente} mined{minado} confirmed{confirmado} other{}}

# txnSuccess
source: Transaction succesfully sent!
es: ¡Transacción enviada con éxito!

source: Type
es: Tipo

source: Unlock wallet
es: Desbloquear cartera

# unstakeTxnSuccess
source: Unstake transaction succesfully sent!
es: ¡Transacción de unstake enviada con éxito!

source: Update available
es: Actualización disponible

# updateError
source: There was an issue with the update. Please try again.
es: Hubo un problema con la actualización. Por favor, inténtalo de nuevo.

source: Update now
es: Actualiza ahora

# updateToVersion
source: Update to version {versionNumber}
es: Actualizar a la versión {versionNumber}

# validationDecimals
source: Only 9 decimal digits supported
es: Solo se admiten 9 dígitos decimales

# validationEmpty
source: Please enter an amount
es: Por favor, ingrese una cantidad

# validationEnoughFunds
source: Not enough Funds
es: Fondos insuficientes

# validationInvalidAmount
source: Invalid amount
es: Cantidad inválida

# validationMinFee
source: Fee should be higher than
es: La tarifa de minado tiene que ser mayor que

# validationNoZero
source: Amount cannot be zero
es: La cantidad no puede ser cero

# viewOnExplorer
source: View on Block Explorer
es: Ver en el Explorador de Bloques

# verifyLabel
source: Verify
es: Verificar

# versionNumber
source: Version {versionNumber}
es: Versión {versionNumber}

# vttException
source: Error building the transaction
es: Error creando la transacción

# vttSendSteps
source: {currentStepIndex, select, Transaction{Transaction} MinerFee{Miner Fee} Review{Review} other{unused}}
es: {currentStepIndex, select, Transaction{Transacción} MinerFee{Minera cuota} Review{La revisión} other{unused}}

# walletConfig01
source: Your Xprv key allows you to export and back up your wallet at any point after creating it.
es: Tu clave Xprv te permite exportar y hacer una copia de seguridad de tu cartera en cualquier momento después de crearla.

# walletConfig02
source: Privacy-wise, your Xprv key is equivalent to a secret recovery phrase. Do not share it with anyone, and never store it in a file in your device or anywhere else electronically.
es: En términos de privacidad, tu clave Xprv es equivalente a una frase de recuperación secreta. No la compartas con nadie y nunca la almacenes en un archivo en tu dispositivo ni en ningún otro lugar electrónico.

# walletConfig03
source: Your Xprv key will be protected with the password below. When importing the Xprv on this or another app, you will be asked to type in that same password.
es: Tu clave Xprv estará protegida con la contraseña a continuación. Al importar la clave Xprv en esta u otra aplicación, se te pedirá que escribas esa misma contraseña.

# walletConfigHeader
source: Export the Xprv key of my wallet
es: Exportar la clave Xprv de mi cartera

# walletDetail01
source: You can better keep track of your different wallets by giving each its own name and description.
es: Puedes hacer un mejor seguimiento de tus diferentes carteras dándoles a cada una su propio nombre y descripción.

# walletDetail02
source: Wallet names make it easy to quickly change from one wallet to another. Wallet descriptions can be more elaborate and rather describe the purpose of a wallet or any other metadata.
es: Los nombres de las carteras facilitan cambiar rápidamente de una cartera a otra. Las descripciones de las carteras pueden ser más detalladas y describir el propósito de una cartera u otros metadatos.

# walletDetailHeader
source: Identify your wallet
es: Identifica tu cartera

# walletNameHint
source: My first million Wits
es: Mis primeros millones de Wits

# walletSecurity01
source: Please, read carefully before continuing.
es: Por favor, lee con atención antes de continuar.
